--- crates/oc-crypto/src/hardened.rs
+++ replace <impl std::fmt::Debug for HardenedBytes>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -125,17 +125,17 @@
         self.inner.zeroize();
         page_guard::unlock(ptr, len);
     }
 }
 
 impl std::fmt::Debug for HardenedBytes {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         // Never expose the bytes — even length is sufficient metadata.
-        write!(f, "[REDACTED; {} bytes]", self.inner.len())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
