--- crates/oc-crypto/src/hardened.rs
+++ replace HardenedBytes::is_empty -> bool with false
@@ -35,17 +35,17 @@
         Ok(Self { inner })
     }
 
     pub fn len(&self) -> usize {
         self.inner.len()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.inner.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Copy `data` into a new page-locked, DONT_DUMP-marked buffer.
     ///
     /// - `data.is_empty()` returns an empty buffer without touching `mlock`.
     /// - On `dont_dump` failure after a successful `lock`, the lock is undone and the error is
     ///   propagated.
     pub fn from_slice(data: &[u8]) -> Result<Self, MemGuardError> {
