--- crates/oc-crypto/src/key_cache.rs
+++ replace >= with < in KeyCache<V>::insert
@@ -165,17 +165,17 @@
     /// later triggers `Drop` (zeroize + munlock for `HardenedBytes`).
     pub fn insert(&self, id: &str, key: V) {
         let mut inner = self.lock();
         inner.evict_expired(self.ttl);
 
         // Replacing an existing id must not evict a different entry.
         inner.remove(id);
 
-        if inner.entries.len() >= self.max_entries {
+        if inner.entries.len() < /* ~ changed by cargo-mutants ~ */ self.max_entries {
             // O(log n): the smallest tick is the least recently used entry.
             if let Some((_, lru_id)) = inner.recency.iter().next().map(|(t, k)| (*t, k.clone())) {
                 inner.remove(&lru_id);
             }
         }
 
         let tick = inner.bump();
         inner.recency.insert(tick, id.to_string());
