--- crates/oc-crypto/src/page_guard.rs
+++ replace == with != in lock
@@ -15,17 +15,17 @@
 /// Lock a region of memory so it cannot be swapped to disk.
 ///
 /// - Unix: `mlock(2)`. On non-zero return, captures `errno` via `std::io::Error::last_os_error()`
 ///   and returns `MlockFailed`.
 /// - Windows: `VirtualLock`. On zero return, returns `VirtualLockFailed`.
 ///
 /// Calling with `len == 0` is a no-op success.
 pub fn lock(addr: *const u8, len: usize) -> Result<(), MemGuardError> {
-    if len == 0 {
+    if len != /* ~ changed by cargo-mutants ~ */ 0 {
         return Ok(());
     }
     #[cfg(unix)]
     {
         let ret = unsafe { libc::mlock(addr.cast::<libc::c_void>(), len) };
         if ret != 0 {
             return Err(MemGuardError::MlockFailed(std::io::Error::last_os_error()));
         }
