--- crates/oc-crypto/src/page_guard.rs
+++ replace lock -> Result<(), MemGuardError> with Ok(())
@@ -15,45 +15,17 @@
 /// Lock a region of memory so it cannot be swapped to disk.
 ///
 /// - Unix: `mlock(2)`. On non-zero return, captures `errno` via `std::io::Error::last_os_error()`
 ///   and returns `MlockFailed`.
 /// - Windows: `VirtualLock`. On zero return, returns `VirtualLockFailed`.
 ///
 /// Calling with `len == 0` is a no-op success.
 pub fn lock(addr: *const u8, len: usize) -> Result<(), MemGuardError> {
-    if len == 0 {
-        return Ok(());
-    }
-    #[cfg(unix)]
-    {
-        let ret = unsafe { libc::mlock(addr.cast::<libc::c_void>(), len) };
-        if ret != 0 {
-            return Err(MemGuardError::MlockFailed(std::io::Error::last_os_error()));
-        }
-        Ok(())
-    }
-    #[cfg(windows)]
-    {
-        let ret = unsafe { windows_sys::Win32::System::Memory::VirtualLock(addr as *const _, len) };
-        if ret == 0 {
-            return Err(MemGuardError::VirtualLockFailed(std::io::Error::last_os_error()));
-        }
-        Ok(())
-    }
-    #[cfg(not(any(unix, windows)))]
-    {
-        let _ = addr;
-        // No platform primitive available; surface an error rather than silently
-        // pretending the page is locked.
-        Err(MemGuardError::MlockFailed(std::io::Error::new(
-            std::io::ErrorKind::Unsupported,
-            "mlock not available on this platform",
-        )))
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Mark a region of memory as non-dumpable in core files.
 ///
 /// - Linux: `madvise(MADV_DONTDUMP)`.
 /// - All other platforms: no-op success (no equivalent primitive).
 #[expect(clippy::missing_const_for_fn, reason = "contains FFI + non-const error path")]
 pub fn dont_dump(addr: *const u8, len: usize) -> Result<(), MemGuardError> {
