--- crates/oc-crypto/src/page_guard.rs
+++ replace != with == in lock
@@ -21,17 +21,17 @@
 /// Calling with `len == 0` is a no-op success.
 pub fn lock(addr: *const u8, len: usize) -> Result<(), MemGuardError> {
     if len == 0 {
         return Ok(());
     }
     #[cfg(unix)]
     {
         let ret = unsafe { libc::mlock(addr.cast::<libc::c_void>(), len) };
-        if ret != 0 {
+        if ret == /* ~ changed by cargo-mutants ~ */ 0 {
             return Err(MemGuardError::MlockFailed(std::io::Error::last_os_error()));
         }
         Ok(())
     }
     #[cfg(windows)]
     {
         let ret = unsafe { windows_sys::Win32::System::Memory::VirtualLock(addr as *const _, len) };
         if ret == 0 {
