--- crates/oc-crypto/src/page_guard.rs
+++ replace != with == in dont_dump
@@ -58,17 +58,17 @@
 #[expect(clippy::missing_const_for_fn, reason = "contains FFI + non-const error path")]
 pub fn dont_dump(addr: *const u8, len: usize) -> Result<(), MemGuardError> {
     if len == 0 {
         return Ok(());
     }
     #[cfg(target_os = "linux")]
     {
         let ret = unsafe { libc::madvise(addr as *mut libc::c_void, len, libc::MADV_DONTDUMP) };
-        if ret != 0 {
+        if ret == /* ~ changed by cargo-mutants ~ */ 0 {
             return Err(MemGuardError::MadviseFailed(std::io::Error::last_os_error()));
         }
         Ok(())
     }
     #[cfg(not(target_os = "linux"))]
     {
         let _ = addr;
         Ok(())
