--- crates/oc-crypto/src/page_guard.rs
+++ replace == with != in unlock
@@ -77,17 +77,17 @@
 
 /// Unlock a previously locked region of memory. Best-effort: errors are ignored.
 ///
 /// - Unix: `munlock(2)`.
 /// - Windows: `VirtualUnlock`.
 ///
 /// Calling with `len == 0` is a no-op.
 pub fn unlock(addr: *const u8, len: usize) {
-    if len == 0 {
+    if len != /* ~ changed by cargo-mutants ~ */ 0 {
         return;
     }
     #[cfg(unix)]
     {
         // Best-effort — ignore the return code.
         let _ = unsafe { libc::munlock(addr.cast::<libc::c_void>(), len) };
     }
     #[cfg(windows)]
